Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: To learn more about the usage of the Vert.x Mutiny API, refer to https://smallrye.io/smallrye-mutiny-vertx-bindings.
zh_cn: 要了解更多关于Vert.x Mutiny API的用法，请参考 https://smallrye.io/smallrye-mutiny-vertx-bindings

source: To make the test pass, we also need to update `ReactiveGreetingResourceTest.kt` like so:
zh_cn: 为了使测试通过，我们还需要像这样更新 `ReactiveGreetingResourceTest.kt` :

source: To make your Quarkus application accessible to another application running on a different domain, you need to configure cross-origin resource sharing (CORS). For more information about the CORS filter that is provided by Quarkus, see the xref:http-reference.adoc#cors-filter[HTTP reference] information.
zh_cn: 如果您打算让您的Quarkus应用程序可以被运行在不同区域的另一个应用程序访问，您将需要配置CORS（Cross-Origin资源共享）。请阅读 link:http-reference.html#cors-filter[TTP reference] 以了解更多关于Quarkus所提供的CORS过滤器信息。

source: To mirror the AWS Lambda environment as closely as possible in a dev environment, the Quarkus Amazon Lambda extension boots up a mock AWS Lambda event server in Quarkus Dev and Test mode. This mock event server simulates a true AWS Lambda environment.
zh_cn: 为了在开发环境中尽可能地反映AWS Lambda环境，Quarkus Amazon Lambda扩展在Quarkus 开发和测试模式下启动了一个模拟的AWS Lambda事件服务器。这个模拟的事件服务器模拟了一个真正的AWS Lambda环境。

source: To persist objects received from Kafka into a database, you can use Hibernate Reactive with Panache.
zh_cn: 为了将从Kafka收到的对象持久化到数据库中，您可以结合使用Hibernate Reactive与Panache。

source: To persist objects received from Kafka into a database, you can use Hibernate with Panache.
zh_cn: 为了将从Kafka接收到的对象持久化到数据库中，您可以结合使用Hibernate与Panache。

source: To receive messages from RabbitMQ:
zh_cn: 要接收来自 RabbitMQ 的消息：

source: To reduce the amount of log written by the Kafka client, Quarkus sets the level of the following log categories to `WARNING`:
zh_cn: 为了减少Kafka客户端的日志量，Quarkus将以下日志类别的级别设置为 `WARNING`：

source: To reduce the amount of times Quarkus needs to restart, `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` is registered as a global `ClassOrderer` as described in the link:https://junit.org/junit5/docs/current/user-guide/#writing-tests-test-execution-order-classes[JUnit 5 User Guide]. The behavior of this `ClassOrderer` is configurable via `junit-platform.properties` (see the source code or javadoc for more details). It can also be disabled entirely by setting another `ClassOrderer` that is provided by JUnit 5 or even your own custom one. + Please note that as of JUnit 5.8.2 link:https://github.com/junit-team/junit5/issues/2794[only a single `junit-platform.properties` is picked up and a warning is logged if more than one is found]. If you encounter such warnings, you can get rid of them by removing the Quarkus-supplied `junit-platform.properties` from the classpath via an exclusion:
zh_cn: 为了减少Quarkus需要重启的次数， `io.quarkus.test.junit.util.QuarkusTestProfileAwareClassOrderer` 被注册为全局 `ClassOrderer` ，如 link:https://junit.org/junit5/docs/current/user-guide/#writing-tests-test-execution-order-classes[JUnit 5用户指南] 中所述。这个orderer的行为可以通过 `junit-platform.properties` （更多细节见源代码或javadoc）来配置。它也可以通过配置另一个由JUnit 5所提供的ClassOrderer，甚至是您自己的自定义Orderer来完全禁用。+ 请注意，从JUnit 5.8.2开始 link:https://github.com/junit-team/junit5/issues/2794[只能有一个 `junit-platform.properties` 被使用，如果超过一个就会有警告记录] 。如果您遇到这样的警告，您可以通过从classpath中移除Quarkus提供的 `junit-platform.properties` 来删除它们：

source: To register a class for reflection, one would need to create a Quarkus processor class and add a build step that registers reflection:
zh_cn: 要为反射注册一个类，需要创建一个Quarkus处理器类并添加一个注册反射的构建步骤：

source: To register meters, you need a reference to a `MeterRegistry`, which is configured and maintained by the Micrometer extension. The `MeterRegistry` can be injected into your application as follows:
zh_cn: 要注册meters，您需要一个对 `MeterRegistry` 的引用，该引用由Micrometer扩展配置和维护。 `MeterRegistry` 可以按以下方式注入到您的应用程序中：

source: To retrieve an increment using its key, we will have to run the below command:
zh_cn: 要使用指定的键查询增量，我们须运行以下命令：

source: To run the application in a dev mode, use:
zh_cn: 要在开发模式下运行应用程序，请使用：

source: To run the application in dev mode, use:
zh_cn: 要在开发模式下运行应用程序，请使用：

source: To run the application, don’t forget to start a database and provide the configuration to your application.
zh_cn: 要运行应用程序，不要忘记启动数据库并为应用程序提供配置。

source: To run your applications as native, first we need to build the native executables:
zh_cn: 要以本地方式运行你的应用程序，我们首先需要构建本地可执行文件：

source: To schedule a Job execution, please refer to the quarkus.jberet.job.”job-name”.cron and quarkus.jberet.job.”job-name”.params.”param-key” configurations.
zh_cn: 要安排工作的执行，请参考quarkus.jberet.job.”job-name”.cron和quarkus.jberet.job.”job-name”.params.”param-key”配置。

source: To see the `GreetingResourceIT` run against the native executable, use `./mvnw verify -Pnative`:
zh_cn: 要看到 `GreetingResourceIT` 面向原生可执行文件运行，使用 `./mvnw verify -Pnative` ：

source: To see the `NativeGreetingResourceIT` run against the native executable, use `./mvnw verify -Pnative`:
zh_cn: 要查看针对原生可执行文件运行 `NativeGreetingResourceIT` ，请用 `./mvnw verify -Pnative`：

source: To see the `usage` statement, and validate AWS configuration:
zh_cn: 要查看 `用法` 声明，并验证AWS配置：

source: To see the list of current increments keys, run the following command:
zh_cn: 要查看当前增量键的列表，请运行以下命令：

source: To see this feature in action, first execute:
zh_cn: 要体验到这个功能的作用，首先要执行：

source: To send messages to Kafka from an HTTP endpoint, inject an `Emitter` (or a `MutinyEmitter`) in your endpoint:
zh_cn: 要从HTTP节点向Kafka发送消息，可以在您的节点中注入一个 `Emitter` (或一个 `MutinyEmitter` )：

source: To send messages to RabbitMQ:
zh_cn: 要向 RabbitMQ 发送消息：

source: To send to Kafka entities managed by Hibernate Reactive, we recommend using:
zh_cn: 为了将Hibernate Reactive管理的实体发送到Kafka，建议使用：

source: To stand up the Config Server required for this guide, please follow the instructions outlined https://github.com/spring-guides/gs-centralized-configuration#stand-up-a-config-server[here]. The end result of that process is a running Config Server that will provide the `Hello world` value for a configuration property named `message` when the application querying the server is named `a-bootiful-client`.
zh_cn: 建立该指南所需的 配置服务器 (Config Server)，请遵循 link:https://github.com/spring-guides/gs-centralized-configuration#stand-up-a-config-server[这里] 的说明。该过程的最终目的是创建一个正在运行的且应用程序查询名为 `a-bootiful-client` 的服务器时，会为名为 `message` 的配置属性提供值为 `Hello world` 的配置服务器。

source: To start a Keycloak Server you can use Docker and just run the following command:
zh_cn: 要启动Keycloak服务器，您可以使用Docker服务，且只需运行以下命令：

source: To start a MongoDB database for your unit tests, Quarkus provides two `QuarkusTestResourceLifecycleManager` that relies on link:https://github.com/flapdoodle-oss/de.flapdoodle.embed.mongo[Flapdoodle embedded MongoDB].
zh_cn: 为了给你的单元测试启动MongoDB数据库，Quarkus提供了两个 `QuarkusTestResourceLifecycleManager` 依赖于 link:https://github.com/flapdoodle-oss/de.flapdoodle.embed.mongo[Flapdoodle嵌入式MongoDB] 。

source: To this end, Quarkus provides a very convenient way of creating a native Linux executable by leveraging a container runtime such as Docker or podman. The easiest way of accomplishing this task is to execute:
zh_cn: 为此，Quarkus提供了一个非常方便的方法，通过利用容器运行时（如Docker或podman）来创建一个原生Linux可执行文件。完成这项任务的最简单方法是执行：

source: To use Alexa with Quarkus native, you need to use the https://github.com/quarkiverse/quarkus-amazon-alexa[Quarkus Amazon Alexa extension hosted at the Quarkiverse Hub].
zh_cn: 要使用带有Quarkus原生的Alexa ，你需要使用link:https://github.com/quarkiverse/quarkus-amazon-alexa[托管在Quarkiverse Hub上的Quarkus Amazon Alexa扩展]

source: To use Mandrel instead of GraalVM CE, update the `FROM` clause to: `FROM quay.io/quarkus/ubi-quarkus-mandrel:$TAG AS build`. `$TAG` can be found on the https://quay.io/repository/quarkus/ubi-quarkus-mandrel?tab=tags[Quarkus Mandrel Images Tags page].
zh_cn: 要使用Mandrel而不是GraalVM CE，请将 `FROM` 子句更新为: `FROM quay.io/quarkus/ubi-quarkus-mandrel:$TAG AS build` 。 `$TAG` 可以在 https://quay.io/repository/quarkus/ubi-quarkus-mandrel?tab=tags[Quarkus Mandrel镜像标签页]上找到。

source: To use a `MULTICAST` queue, you need to provide the _FQQN_ (fully-qualified queue name) instead of just the name of the queue:
zh_cn: 要使用 `MULTICAST` 队列，你需要提供 _FQQN_ （完全限定队列名称），而不仅仅是队列的名称:

source: To use an existing queue, you need to configure the `address`, `container-id` and, optionally, the `link-name` attributes. For example, if you have an Apache Artemis broker configured with:
zh_cn: 要使用一个现有的队列，你需要配置 `address` , `container-id` 及可选的 `link-name` 属性。例如，如果你有一个Apache Artemis代理，使用以下方式配置：

source: To use the connector, you need to add the `quarkus-smallrye-reactive-messaging-amqp` extension.
zh_cn: 为了使用连接器，你需要添加 `quarkus-smallrye-reactive-messaging-amqp` 扩展。

source: To use the extension, add the dependency to the target project:
zh_cn: 要使用该扩展，请将该依赖性添加到目标项目中：

source: To use them with MongoDB with Panache you need to annotate the method that starts the transaction with the `@Transactional` annotation.
zh_cn: 要将它们与带有 Panache 的 MongoDB 一起使用，你需要在相应的方法上使用 `@Transactional` 注解启动事务。

source: To use them, you need to add the `io.quarkus:quarkus-test-mongodb` dependency to your pom.xml.
zh_cn: 要使用它们，你需要在你的pom.xml中添加 `io.quarkus:quarkus-test-mongodb` 依赖。

source: To use this base image, use the following `Dockerfile`:
zh_cn: 要使用该基础镜像，使用以下 `Dockerfile`:

source: To use this failure handler, the bean must be exposed with the `@Identifier` qualifier and the connector configuration must specify the attribute `mp.messaging.incoming.$channel.[key|value]-deserialization-failure-handler` (for key or value deserializers).
zh_cn: 要使用这个故障处理的handler，Bean必须使用 `@Identifier` 限定符来暴露，并且connector配置必须指定属性 `mp.messaging.incoming.$channel.[key|value]-deserialization-failure-handler` (对于键或值的反序列化器)。

source: To use this failure handler, the bean must be exposed with the `@Identifier` qualifier and the connector configuration must specify the attribute `mp.messaging.outgoing.$channel.[key|value]-serialization-failure-handler` (for key or value serializers).
zh_cn: 要使用该故障处理，Bean必须用 `@Identifier` 限定符修饰，并且connector的配置必须指定属性 `mp.messaging.outgoing.$channel.[key|value]-serialization-failure-handler` (对于键或值序列化器)。

source: To use this simply override the bean you wish to mock with a class in the `src/test/java` directory, and put the `@Alternative` and `@Priority(1)` annotations on the bean. Alternatively, a convenient `io.quarkus.test.Mock` stereotype annotation could be used. This built-in stereotype declares `@Alternative`, `@Priority(1)` and `@Dependent`. For example if I have the following service:
zh_cn: 要使用这个方法，只需用 `src/test/java` 目录中的一个类来覆盖您想mock的Bean，并在Bean上加上 `@Alternative` 和 `@Priority(1)` 注解。另外，也可以使用 `io.quarkus.test.Mock` stereotype注释。这个内置的stereotype声明了 `@Alternative` 、 `@Priority(1)` 和 `@Dependent` 。例如，如果我有以下的服务：

source: To verify your setup, that you have the AWS CLI installed, executed aws configure for the AWS access keys, and setup the `LAMBDA_ROLE_ARN` environment variable (as described above), please execute `manage.sh` without any parameters. A usage statement will be printed to guide you accordingly.
zh_cn: 为了验证你的设置，是否安装了AWS CLI，是否为AWS访问密钥执行了aws configure，是否设置了 `LAMBDA_ROLE_ARN` 环境变量（如上所述），请执行不带任何参数的 `manage.sh` 。将会打印出一个使用说明，来对你进行相应的指导。

source: To view metrics, execute `curl localhost:8080/q/metrics/`
zh_cn: 要查看metrics，请执行 `curl localhost:8080/q/metrics/`

source: To visually see the chunks in the response, we append a separator
zh_cn: 为了直观地看到响应中的分块，我们添加了一个分隔符

source: To write a blog:
zh_cn: 写博客：

source: Today’s users embrace applications with milliseconds of response time, 100% uptime, lower latency, push data instead of pull, higher throughput, and elasticity. However, these features are nearly impossible to achieve using yesterday’s software architecture without a considerable investment in resources, infrastructure, and tooling. The world changed, and having dozens of servers, long response times (&gt; 500 ms), downtime due to maintenance or waterfalls of failures does not meet the expected user experience.
zh_cn: 今天的用户接受具有几毫秒响应时间、100%正常运行时间、更低延迟、推送数据而不是拉动、更高的吞吐量和弹性的应用程序。然而，如果不对资源、基础设施和工具进行大量投资，使用昨天的软件架构几乎不可能实现这些功能。世界变了，拥有几十台服务器、较长的响应时间（>500毫秒）、因维护或瀑布式的故障而导致的停机时间，并不能满足预期的用户体验。

source: Token Claims And SecurityIdentity Roles
zh_cn: 令牌声明(Token Claims)和安全身份角色(SecurityIdentity Roles)

source: Token Decryption
zh_cn: 令牌解密

source: Token Propagation
zh_cn: 令牌传播

source: Token Verification And Introspection
zh_cn: 代币验证(Token Verification)和自省(Introspection)

source: Tooling
zh_cn: 工具

source: Total Builds
zh_cn: 总构建

source: Tracing
zh_cn: 跟踪

source: Tracing & Debugging
zh_cn: 追踪和调试

source: Tracing with AWS XRay and GraalVM
zh_cn: 使用AWS XRay和GraalVM进行追踪

source: Traditional EE patterns advise to split entity definition (the model) from the operations you can do on them (DAOs, Repositories), but really that requires a split between the state and its operations even though we would never do something like that for regular objects in the Object Oriented architecture, where state and methods are in the same class. Moreover, this requires two classes per entity, and requires injection of the DAO or Repository where you need to do entity operations, which breaks your edit flow and requires you to get out of the code you're writing to set up an injection point before coming back to use it.
zh_cn: 传统的EE模式建议将实体定义（模型）与它可以进行的操作（DAO、Repository）分开，但实际上这需要将实体状态及其操作分开；但在面向对象的架构里我们不会对普通对象这样做，因为普通对象的状态和方法在同一个类中。此外，这样需要每个实体对应两个类，并且要在需要进行实体操作的地方注入DAO或Repository，这就破坏了你的开发流程，需要你从正在编写的代码中跳出来，建立一个注入点，然后再回来使用它。

source: Traditional EE patterns advise to split entity definition (the model) from the operations you can do on them (DAOs, Repositories), but really that requires an unnatural split between the state and its operations even though we would never do something like that for regular objects in the Object Oriented architecture, where state and methods are in the same class. Moreover, this requires two classes per entity, and requires injection of the DAO or Repository where you need to do entity operations, which breaks your edit flow and requires you to get out of the code you're writing to set up an injection point before coming back to use it.
zh_cn: 传统的EE模式建议将实体定义（模型）与你可以对其进行的操作（DAO、Repositories）分开，但实际上这需要在状态和其操作之间进行不自然的分割，尽管在面向对象的架构中，我们永远不会对普通对象做这样的事情，因为状态和方法是在同一个类中。此外，这需要每个实体有两个类，并且需要在你需要进行实体操作的地方注入DAO或Repository，这就破坏了你的编辑流程，需要你从正在编写的代码中跳出来，建立一个注入点，然后再回来使用它。

source: Traditional Java stacks were engineered for monolithic applications with long startup times and large memory requirements in a world where the cloud, containers, and Kubernetes did not exist. Java frameworks needed to evolve to meet the needs of this new world.
zh_cn: 传统的Java堆栈是为单体应用设计的，启动时间长，内存需求大，而当时还没有云、容器和Kubernetes的存在。Java框架需要发展以满足这个新世界的需求。

source: Transaction Configuration
zh_cn: 事务配置

source: Transaction support inside MongoDB with Panache is still experimental.
zh_cn: 使用Panache的MongoDB内部的事务支持仍处于试验阶段。

source: Transaction-aware consumers
zh_cn: 事务感知型消费者

source: Transactions
zh_cn: 事务

source: Transactions are not supported for Reactive Entities and Repositories.
zh_cn: 响应式实体和存储库不支持事务。

source: Trigger the inclusion on additional extensions based on certain conditions.
zh_cn: 基于特定条件触发包含附加扩展。

source: Trust all the hostnames. If the keys have to be fetched over `HTTPS` and this property is set to `true` then all the hostnames are trusted by default.
zh_cn: 信任所有的主机名。如果钥匙必须通过 `HTTPS` 获得，并且该属性被设置为 `true` ，那么所有的主机名都被默认信任。

source: Type
zh_cn: 类型

source: UBI images can be used without any limitations.
zh_cn: UBI镜像可以不受任何限制地使用。

source: URL of our chat.
zh_cn: 我们聊天的URL。

source: USAGE
zh_cn: 使用方法

source: Understanding the Platform concept
zh_cn: 理解平台概念

source: Unified Config
zh_cn: 统一配置

source: Unified configuration
zh_cn: 统一配置

source: Unifies Imperative and Reactive
zh_cn: 统一指令式和响应式

source: Unifies imperative and reactive
zh_cn: 统一指令式和响应式

source: Unlike the `ConsumerRebalanceListener` from Apache Kafka, the `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` methods pass the Kafka Consumer and the set of topics/partitions.
zh_cn: 与Apache Kafka的 `ConsumerRebalanceListener` 不同， `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` 的方法会传递Kafka消费者和topic/分区集合。

source: Unlike the previous example using the _payloads_ directly, you can also use `Message` directly:
zh_cn: 与之前直接使用 _有效载荷_ 的例子不同，你也可以直接使用 `Message` 。

source: Unlike with _classic_ Hibernate, you can't use `@Transactional`. Instead, we use `Panache.withTransaction` and persist our entity. The `map` is used to return a `Uni<Void>` and not a `Uni<Fruit>`.
zh_cn: 与 _常规的_ Hibernate不同，您无法使用 `@Transactional` 注解。相反，可以使用 `Panache.withTransaction` ，并持久化实体实例。`map` 用来返回一个 `Uni<Void>` 实例，而不是一个 `Uni<Fruit>` 实例。

source: Unsupported Spring Scheduled functionalities
zh_cn: 不支持的Spring Scheduled功能

source: Update code
zh_cn: 更新代码

source: Update the Lambda
zh_cn: 更新Lambda

source: Update the `oauth.client.id`, `oauth.client.secret` and `oauth.token.endpoint.uri` values.
zh_cn: 更改 `oauth.client.id` ， `oauth.client.secret` 和 `oauth.token.endpoint.uri` 值。

source: Updating the application configuration file
zh_cn: 更新该应用程序的配置文件

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] interface, i.e.:
zh_cn: 更新 link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/RedisClient.java[`RedisClient`] 接口，即：

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] interface, i.e.:
zh_cn: 更新 link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/reactive/ReactiveRedisClient.java[`ReactiveRedisClient`] 接口，即：

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/ReactiveRedisClientImpl.java[`ReactiveRedisClientImpl`], i.e.:
zh_cn: 更新 link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/ReactiveRedisClientImpl.java[`ReactiveRedisClientImpl`] ，即：

source: Updating the https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/RedisClientImpl.java[`RedisClientImpl`], i.e.:
zh_cn: 更新 link:https://github.com/quarkusio/quarkus/blob/main/extensions/redis-client/runtime/src/main/java/io/quarkus/redis/client/runtime/RedisClientImpl.java[`RedisClientImpl`] ，即：

source: Use Apache Kafka, Avro serialized records, and connect to a schema registry.
zh_cn: 使用Apache Kafka，Avro序列化记录，并连接到一个模式注册中心。

source: Use ConfigMaps as a configuration source for your Quarkus applications.
zh_cn: 使用ConfigMaps作为Quarkus应用程序的配置源。

source: Use Ctrl-C to stop the Quarkus server.
zh_cn: 使用Ctrl-C来停止Quarkus服务器。

source: Use Kogito to add DRL files with rules.
zh_cn: 使用Kogito来添加带有规则的DRL文件。

source: Use Kogito to add business automation and power it up with DMN decision support.
zh_cn: 使用Kogito来增加业务自动化，并通过DMN决策支持为其提供动力。

source: Use Kogito to add business automation to power it up with predictions.
zh_cn: 使用Kogito来添加业务自动化，为其提供预测的动力。

source: Use Spring Boot's `@ConfigurationProperties` in place of MicroProfile Config annotations
zh_cn: 使用Spring Boot的 `@ConfigurationProperties` ，代替MicroProfile配置注解

source: Use `KafkaCompanion` to create producer task which writes 10 records to 'orders' topic.
zh_cn: 使用 `KafkaCompanion` 来创建生产者任务，用于向 'orders' topic写入10条记录。

source: Use `Uni` when you have a single result. Use `Multi` when you have multiple items that may be emitted asynchronously.
zh_cn: 当你有一个单一的结果时，使用 `Uni` 。当你有多个可能被异步发射的项目时，使用 `Multi` 。

source: Use `mp.jwt.verify.publickey.algorithm` to customize the verification algorithm (default is `RS256`), for example, set it to `ES256` when working with the EC keys.
zh_cn: 使用 `mp.jwt.verify.publickey.algorithm` 来定制验证算法（默认为 `RS256` ），例如，在使用EC密钥时，将其设置为 `ES256` 。

source: Use a custom `@Produces` method to create and configure a customized `MeterRegistry` if you need to.
zh_cn: 如果需要的话，请使用自定义的 `@Produces` 方法来创建和配置一个自定义的 `MeterRegistry` 。

source: Use another test runner that starts the application from the native file before the tests. The executable is retrieved by the _Failsafe Maven Plugin_.
zh_cn: 这里使用另一个测试runner来通过本地文件在测试之前启动应用。该执行文件通过 _Failsafe Maven Plugin_ 来获取。

source: Use another test runner that starts the application from the native file before the tests. The executable is retrieved using the `native.image.path` system property configured in the _Failsafe Maven Plugin_.
zh_cn: 使用另一个测试运行器，在测试前从原生文件启动应用程序。使用 _Failsafe Maven Plugin_ 中配置的 `native.image.path` 系统属性检索该可执行文件。

source: Use bundler to fetch all required gems in their respective versions
zh_cn: 使用bundler获取各自版本中所需的所有gems

source: Use mutable jars to rebuild your application with different build time configurations.
zh_cn: 使用易变的jars来重建具有不同构建时间配置的应用程序。

source: Use platform-specific install tools like https://sdkman.io/jdks#Oracle[sdkman], https://github.com/graalvm/homebrew-tap[homebrew], or https://github.com/ScoopInstaller/Java[scoop].
zh_cn: 使用特定平台的安装工具，如 https://sdkman.io/jdks#Oracle[sdkman] 、https://github.com/graalvm/homebrew-tap[homebrew] 或 https://github.com/ScoopInstaller/Java[scoop] 。

source: Use public fields. Get rid of dumb getter and setters. Hibernate ORM w/o Panache also doesn't require you to use getters and setters, but Panache will additionally generate all getters and setters that are missing, and rewrite every access to these fields to use the accessor methods. This way you can still write _useful_ accessors when you need them, which will be used even though your entity users still use field accesses. This implies that from the Hibernate perspective you're using accessors via getters and setters even while it looks like field accessors.
zh_cn: 使用public字段，抛开愚蠢的getter和setter方法。Hibernate ORM Panache不要求你使用getter和setter方法，但Panache会额外生成所有缺失的getter和setter方法，并将所有对这些字段的访问重写为getter/setter方法的调用。这样，当你需要的时候，仍可以编写 _有用的_ 访问器，即使实体类的调用者仍然使用字段访问，实际也会使用这些访问器。这意味着从Hibernate的角度来看，你正在通过getter和setter方法使用访问器，即使代码看起来像字段访问器。

source: Use public fields. Get rid of dumb getter and setters. Under the hood, we will generate all getters and setters that are missing, and rewrite every access to these fields to use the accessor methods. This way you can still write _useful_ accessors when you need them, which will be used even though your entity users still use field accesses.
zh_cn: 使用公共字段。摆脱繁琐的getter和setters。在后台，我们将生成所有缺失的getter和setter，并重写对这些字段的每个访问，以使用访问器方法。这样，当你需要时，你仍然可以写出 _有用的_ 访问器，即使你的实体用户仍然使用字段访问，也会被使用。

source: Use the <a href="https://github.com/quarkusio/quarkus/discussions">Discussions</a> section on our GitHub project.
zh_cn: 使用我们GitHub项目上的<a href="https://github.com/quarkusio/quarkus/discussions">讨论</a>部分。

source: Use the Flyway instance directly
zh_cn: 直接使用Flyway实例

source: Use the Quarkus CLI to create, build, run, and manage extensions for Quarkus projects.
zh_cn: 使用Quarkus CLI来创建、构建、运行和管理Quarkus项目的扩展。

source: Use the Spring `@Scheduled` annotation with a cron-like expression to instruct Quarkus to schedule this method run. In this example we're scheduling a task to be executed at 10:15am every day.
zh_cn: 使用一个带有类似于cron表达式的Spring `@Scheduled` 注解来指示Quarkus安排这个方法的运行。在这个例子里，我们将会安排一个每天上午10:15都会被执行的任务。

source: Use the `invoke` command to invoke your function.
zh_cn: 使用 `invoke` 命令来调用你的函数。
